
# Parameters
nc: 3  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs


# YOLOv8.0n backbone
#backbone:
#  # [from, repeats, module, args]
#  # MobileNetV4ConvSmall, MobileNetV4ConvLarge,  MobileNetV4ConvMedium,
#  # MobileNetV4HybridMedium, MobileNetV4HybridLarge  支持这五种版本
#  - [-1, 1, MobileNetV4ConvSmall, []]  # 4 将左面的MobileNetV4ConvSmall改为上面任意一个即替换对应的MobileNetV4版本
#  - [-1, 1, SPPF, [1024, 5]]  # 5 1024和512doukey如果后边head需要更改为768
#
#
#head:
#      - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 6
#      - [[-1, 3], 1, Concat, [1]]  # 7 cat backbone P4
#      - [-1, 3, C2f, [512]]  # 8
#
#      - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 9
#      - [[-1, 2], 1, Concat, [1]]  # 10 cat backbone P3
#      - [-1, 3, C2f, [256]]  # 11 (P3/8-small)
#                 #这个里面添加了注意力机制但是还没有添加相关的代码
#
#      - [-1, 1, Conv, [256, 3, 2]] # 12
#      - [[-1, 8], 1, Concat, [1]]  # 13 cat head P4
#      - [-1, 3, C2f, [512]]  # 14 (P4/16-medium)
#
#
#
#      - [-1, 1, Conv, [512, 3, 2]] # 15
#      - [[-1, 5], 1, Concat, [1]]  # 16 cat head P5
#      - [-1, 3, C2f, [1024]]  # 17 (P5/32-large)
#
#
#      - [[11, 14, 17], 1, Detect, [nc]]  # Detect(P3, P4, P5)

backbone:
  # [from, repeats, module, args]
  # MobileNetV4ConvSmall, MobileNetV4ConvLarge,  MobileNetV4ConvMedium,
  # MobileNetV4HybridMedium, MobileNetV4HybridLarge  支持这五种版本
  - [-1, 1, MobileNetV4ConvSmall, []]  # 4 将左面的MobileNetV4ConvSmall改为上面任意一个即替换对应的MobileNetV4版本
  - [-1, 1, SPPF, [1024, 5]]  # 5 1024和512doukey如果后边head需要更改为512


#head:第一篇论文创新点
head:
      - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 6
      - [[-1, 3], 1, Concat, [1]]  # 7 cat backbone P4
      - [-1, 3, C2f, [256]]  # 8

      - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 9
      - [[-1, 2], 1, Concat, [1]]  # 10 cat backbone P3
      - [-1, 3, KANBottleneckWithSimAM, [128]]  # 11 (P3/8-small)


      - [-1, 1, Conv, [256, 3, 2]] # 12
      - [[-1, 8], 1, Concat, [1]]  # 13 cat head P4
      - [-1, 3, KANBottleneckWithSimAM, [256]]  # 14 (P4/16-medium)



      - [-1, 1, Conv, [512, 3, 2]] # 15
      - [[-1, 5], 1, Concat, [1]]  # 16 cat head P5
      - [-1, 3, KANBottleneckWithSimAM, [512]]  # 17 (P5/32-large)


      - [[11, 14, 17], 1, Detect, [nc]]  # Detect(P3, P4, P5)





#这是第一个版本去掉大目标检测头增加小目标检测头
#head:

#  - [[11, 14, 17], 1, Detect, [nc]] # Detect(P2, P3, P4)

#第三个版本的样品这里的版本通道数还有连接的层数发生了变化

#      - [[4, 7, 10], 1, Detect, [nc]]  # Detect(P3, P4, P5)

#      - [[7, 10, 13], 1, Detect, [nc]]  # Detect(P3, P4, P5)


#试验 第二篇论文创新点
#head:
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #    ·  40 × 40 × 1024
#  - [[-1, 3], 1, Concat, [1]] # cat backbone P4     ·  40 × 40 × 1536
#  - [-1, 3, C2f, [512]] # 12                        ·  40 × 40 × 512
#
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #    ·  80 × 80 × 512
#  - [[-1, 2], 1, Concat, [1]] # cat backbone P3     ·  80 × 80 × 768
#  - [-1, 3, C2f, [256]] # 15 (P3/8-small)           ·  80 × 80 × 256
#
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #    · 160 × 160 × 256
#  - [[-1, 1], 1, Concat, [1]] # cat backbone P2     · 160 × 160 × 384
#  - [-1, 3, C2f, [128]] # 18 (P2/4-tiny)            · 160 × 160 × 128
#
#  - [-1, 1, Conv, [128, 3, 2]] #                    ·  80 × 80 × 128
#  - [[-1, 11], 1, Concat, [1]] # cat head P3        ·  80 × 80 × 384
#  - [-1, 3, C2f, [256]] # 21 (P3/8-small)           ·  80 × 80 × 256
#
#  - [-1, 1, Conv, [256, 3, 2]] #                    ·  40 × 40 × 256
#  - [[-1, 8], 1, Concat, [1]] # cat head P4        ·  40 × 40 × 768
#  - [-1, 3, C2f, [512]] # 24 (P4/16-medium)         ·  40 × 40 × 512
#
#  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P2, P3, P4)


#head:
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #    ·  40 × 40 × 1024
#  - [[-1, 3], 1, Concat, [1]] # cat backbone P4     ·  40 × 40 × 1536
#  - [-1, 3, C2f, [512]] # 12                        ·  40 × 40 × 512
#
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #    ·  80 × 80 × 512
#  - [[-1, 2], 1, Concat, [1]] # cat backbone P3     ·  80 × 80 × 768
#  - [-1, 3, C2f, [256]] # 15 (P3/8-small)           ·  80 × 80 × 256
#  - [-1, 1, SimAM, [1e-4]]
#
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #    · 160 × 160 × 256
#  - [[-1, 1], 1, Concat, [1]] # cat backbone P2     · 160 × 160 × 384
#  - [-1, 3, C2f, [128]] # 18 (P2/4-tiny)            · 160 × 160 × 128
#  - [-1, 1, SimAM, [1e-4]]
#
#  - [-1, 1, Conv, [128, 3, 2]] #                    ·  80 × 80 × 128
#  - [[-1, 11], 1, Concat, [1]] # cat head P3        ·  80 × 80 × 384
#  - [-1, 3, C2f, [256]] # 21 (P3/8-small)           ·  80 × 80 × 256
#  - [-1, 1, SimAM, [1e-4]]
#
#  - [-1, 1, Conv, [256, 3, 2]] #                    ·  40 × 40 × 256
#  - [[-1, 8], 1, Concat, [1]] # cat head P4        ·  40 × 40 × 768
#  - [-1, 3, C2f, [512]] # 24 (P4/16-medium)         ·  40 × 40 × 512
#  - [-1, 1, SimAM, [1e-4]]
#
#  - [ -1, 1, Conv, [ 256, 3, 2 ] ] #                    ·  40 × 40 × 256
#  - [ [ -1, 5], 1, Concat, [ 1 ] ] # cat head P4        ·  40 × 40 × 768
#  - [ -1, 3, C2f, [1024] ] # 24 (P4/16-medium)         ·  40 × 40 × 512
#  - [ -1, 1, SimAM, [ 1e-4 ] ]
#
#  - [[16, 20, 24, 28], 1, Detect, [nc]] # Detect(P2, P3, P4)